Service - Income Tax/archive/2022/sample messages/file_request_ir8j_standalone.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
    <soap:Header>
        <add:Action xmlns:add="http://www.w3.org/2005/08/addressing">https://services.ird.govt.nz/GWS/Returns/Return/File</add:Action>
    </soap:Header>
    <soap:Body>
        <ret:File xmlns:ret="https://services.ird.govt.nz/GWS/Returns/">
            <ret:ReturnFileRequestMsg>
                <fil:FileRequestWrapper xmlns:fil="https://services.ird.govt.nz/GWS/Returns/:types/FileRequest">
                    <r8J:fileRequest xmlns:r8J="urn:www.ird.govt.nz/GWS:types/ReturnIR8J.v1" xmlns:rc="urn:www.ird.govt.nz/GWS:types/ReturnCommon.v2">
                        <rc:fileHeader xmlns:cmn="urn:www.ird.govt.nz/GWS:types/Common.v2">
                            <cmn:softwareProviderData>
                                <cmn:softwareProvider>SoftwareProvider</cmn:softwareProvider>
                                <cmn:softwarePlatform>SoftwarePlatform</cmn:softwarePlatform>
                                <cmn:softwareRelease>1</cmn:softwareRelease>
                            </cmn:softwareProviderData>
                            <cmn:identifier IdentifierValueType="IRD">113613831</cmn:identifier>
                            <cmn:accountType>INC</cmn:accountType>
                            <rc:periodEndDate>2018-03-31</rc:periodEndDate>
                            <rc:majorFormType>INC</rc:majorFormType>
                            <rc:minorFormType>8J</rc:minorFormType>
                        </rc:fileHeader>
                        <rc:fileBody>
                            <rc:standardFields>
                                <rc:isNilReturn>false</rc:isNilReturn>
                                <rc:isFinalReturn>false</rc:isFinalReturn>
                                <rc:amendmentRequest>
                                    <rc:isAmended>false</rc:isAmended>
                                    <rc:amendReason/>
                                    <rc:amendDetails/>
                                </rc:amendmentRequest>
                            </rc:standardFields>
                            <rc:formFields xsi:type="r8J:FormFieldsType" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:ic="urn:www.ird.govt.nz/GWS:types/IncomeReturnCommon.v1">
                                <r8J:openingBalance>0.00</r8J:openingBalance>
                                <r8J:incomeTaxPaid>1000.00</r8J:incomeTaxPaid>
                                <r8J:totalFDPPaid>1000.00</r8J:totalFDPPaid>
                                <r8J:totalRWTOnInterest>1000.00</r8J:totalRWTOnInterest>
                                <r8J:imputationAndFDPCredits>1000.00</r8J:imputationAndFDPCredits>
                                <r8J:otherCredits>1000.00</r8J:otherCredits>
                                <r8J:incomeTaxRefunded>1000.00</r8J:incomeTaxRefunded>
                                <r8J:totalFDPRefunds>1000.00</r8J:totalFDPRefunds>
                                <r8J:imputationCreditsAttached>1000.00</r8J:imputationCreditsAttached>
                                <r8J:otherDebits>1000.00</r8J:otherDebits>
                                <r8J:closingBalance>-1000.00</r8J:closingBalance>
                                <r8J:furtherIncomeTaxPayable>0.00</r8J:furtherIncomeTaxPayable>
                                <r8J:fdpReturn>
                                    <r8J:fdpOpeningBalance>1000.00</r8J:fdpOpeningBalance>
                                    <r8J:fdpPaid>1000.00</r8J:fdpPaid>
                                    <r8J:fdpCreditsAttachedReceived>1000.00</r8J:fdpCreditsAttachedReceived>
                                    <r8J:fdpCreditsAttachedPaid>1000.00</r8J:fdpCreditsAttachedPaid>
                                    <r8J:fdpRefunded>1000.00</r8J:fdpRefunded>
                                    <r8J:fdpOtherDebits>1000.00</r8J:fdpOtherDebits>
                                    <r8J:fdpClosingBalance>2000.00</r8J:fdpClosingBalance>
                                </r8J:fdpReturn>
                            </rc:formFields>
                        </rc:fileBody>
                    </r8J:fileRequest>
                </fil:FileRequestWrapper>
            </ret:ReturnFileRequestMsg>
        </ret:File>
    </soap:Body>
</soap:Envelope>